/*
Георг Кантор доказал, что множество всех рациональных чисел счетно (т.е. все рациональные числа можно пронумеровать).
Чтобы упорядочить дроби необходимо их положить в таблицу, как показано на рисунке. В строку с номером i этой матрицы по порядку записаны дроби с числителем i, а в столбец с номером j дроби с знаменателем j.
Вам требуется по числу n найти числитель и знаменатель n-ой дроби.

Формат ввода
Во входном файле дано число n (1 ≤ n ≤ 10^18) — порядковый номер дроби в последовательности.

Формат вывода
В выходной файл требуется вывести через символ / два числа: числитель и знаменатель соответствующей дроби.
*/

#include <iostream>

int main() {
    unsigned long n = 0;
    std::cin >> n;

    long long d = 1;
    while ((d * (d - 1)) / 2 < n) {
        d++;
    }
    d--;

    long long k = n - (d * (d - 1)) / 2;
    if (d % 2 == 0)
        std::cout << d - k + 1 << "/" << k;
        
    else
        std::cout << k << "/" << d - k + 1;

    return 0;
}